
export const grps = [
  { value: 1, label: "ความคุ้มครองสินค้ากลุ่มที่ 1" },
  { value: 2, label: "ความคุ้มครองสินค้ากลุ่มที่ 2" },
  { value: 3, label: "ความคุ้มครองสินค้ากลุ่มที่ 3" },
  { value: 4, label: "ความคุ้มครองสินค้ากลุ่มที่ 4" },
  { value: 5, label: "ความคุ้มครองสินค้ากลุ่มที่ 5" }
];

export const subGRPsCatagories = {
  1: [
    {
      value: 1,
      label: "เครื่องคอมพิมเตอร์และอุปกรณ์ เครื่องใช้สำนักงาน เครื่องใช้ไฟฟ้า"
    },
    {
      value: 2,
      label:
        "อุปกรณ์ช่าง ไม้ปแปรรูป โลหะ เหล็ก วัสดุอุปกรณ์ก่อสร้าง ปูนซีเมนต์บรรจุถุง ปูนซีเมนต์ผสมเสร็จ ยางมะตอยมีบรรจุภัณฑ์"
    },
    { value: 3, label: "อะไหล่รถยนต์ น้ำมันหล่อลื่นบรรจุถังหรือแกลลอน" },
    { value: 4, label: "สินค้าตกแต่งบ้าน เฟอร์นิเจอร์" },
    { value: 5, label: "อุปกรณ์การเรียนการสอน" },
    {
      value: 6,
      label: "ยารักษาโรค อุปกรณ์เครื่องมือแพทย์"
    },
    {
      value: 7,
      label:
        "ผลิตผลทางการเกษตร พืชไร่ พืชสมุนไพรต่าง ๆ ผลิตผลแปรรูปทั้งหมดที่ผลิตจากพืชไร่ (เฉพาะที่มีบรรจุภัณฑ์ห่อหุ้มสินค้า) เช่น ข้าวโพด ข้าวฟ่าง เมล็ดถั่ว ต้นถั่ว มันฝรั่ง มันเทศ มันสำปะหลัง พืชสมุนไพรต่าง ๆ ฝ้าย ปอ ป่าน นุ่น ถั่วเหลือง ละหุ่ง ทานตะวัน งา ปาล์ม ยางพารา ตาล ข้าวเปลือก ข้าวสาร ฯลฯ "
    },
    {
      value: 8,
      label: "เสื้อผ้า อุปกรณ์เครื่องแต่งกาย สิ่งทอ ใยสังเคราะห์ หนังสัตว์"
    },
    {
      value: 9,
      label:
        "สินค้าอุปโภค-บริโภค ผลิตภัณฑ์อาหารแปรรูป สินค้าโชห่วย (เครื่องอุปโภค-บริโภคที่ใช้ในชีวิตประจำวัน)"
    },
    {
      value: 10,
      label:
        "สิ่งมีชีวิตที่เป็นสัตว์เศรษฐกิจ (เฉพาะสัตว์บก) เช่น โค กระบือ ไก่ สุกร ฯลฯ "
    }
  ],
  2: [
    { value: 1, label: "สินค้าเทกอง (สินค้าที่ไม่มีบรรจุภัณฑ์ห่อหุ้ม)" },
    {
      value: 2,
      label:
        "เครื่องดื่มแอลกอฮอล์ โซดา เครื่องดื่มชูกำลัง อาหารและเครื่องดื่มบรรจุขวดแก้ว เครื่องแก้ว ขวดแก้ว บานกระจำทุกประเภท เซรามิค กระเบื้อง สินค้าแตกหักเสียหายง่าย ไข่สด"
    },
    {
      value: 3,
      label:
        "เครื่องจักรทุกประเภท เครื่องยนต์ทุกประเภท (ที่มีน้ำหนักไม่เกินกว่า 1,000 กิโลกรัม ต่อยานพาหนะ)"
    }
  ],
  3: [
    { value: 1, label: "รถยนต์" },
    { value: 2, label: "รถจักรยานยนต์" },
    { value: 3, label: "สินค้าทุกประเภทที่บรรทุกอยู่บนยานพาหนะพื้นเรียบ" },
    {
      value: 4,
      label:
        "เครื่องจักรทุกประเภท เครื่องยนต์ทุกประเภท (ที่มีน้ำหนักเกินกว่า 1,000 กิโลกรัม ต่อยานพาหนะ) รถที่ใช้เพื่อการเกษตรและอุตสาหกรรม เช่น รถไถใหม่ รถเกี่ยวข้าวใหม่ รถแทรกเตอร์ใหม่ รถโฟล์คลิฟท์ใหม่ ฯลฯ "
    }
  ],
  4: [
    { value: 1, label: "อาหารสด อาหารทะเลสด" },
    {
      value: 2,
      label:
        "สิ่งมีชีวิตที่เป็นสัตว์เศรษฐกิจ (เฉพาะสัตว์น้ำ) เช่น กุ้ง หอย ปู ปลา ฯลฯ"
    },
    { value: 3, label: "ผักสด ผลไม้สด ต้นไม้ ดอกไม้ ต้นหญ้า " },
    { value: 4, label: "ไอศครีม อาหารแช่แข็ง หรือสินค้าแช่เย็น" },
    { value: 5, label: "สินค้าที่อยู่ในสภาพต้องควบคุมอุณหภูมิ ฯลฯ " }
  ],
  5: [
    {
      value: 1,
      label:
        "น้ำมันเชื้อเพลิงบรรจุแท็งก์ (ยกเว้นวัตถุอันตรายทุกชนิดตามประกาศกระทรวงอุตสาหกรรม)"
    },
    { value: 2, label: "ของเหลวบรรจุแท็งก์" },
    { value: 3, label: "ก๊าซบรรจุแท๊งก์" }
  ]
};

export const suminsureds = [
  { value: 100000, label: " 100,000 " },
  { value: 200000, label: " 200,000 " },
  { value: 300000, label: " 300,000 " },
  { value: 400000, label: " 400,000 " },
  { value: 500000, label: " 500,000 " },
  { value: 600000, label: " 600,000 " },
  { value: 700000, label: " 700,000 " },
  { value: 800000, label: " 800,000 " },
  { value: 900000, label: " 900,000 " },
  { value: 1000000, label: " 1,000,000 " },
  { value: 1100000, label: " 1,100,000 " },
  { value: 1200000, label: " 1,200,000 " },
  { value: 1300000, label: " 1,300,000 " },
  { value: 1400000, label: " 1,400,000 " },
  { value: 1500000, label: " 1,500,000 " },
  { value: 1600000, label: " 1,600,000 " },
  { value: 1700000, label: " 1,700,000 " },
  { value: 1800000, label: " 1,800,000 " },
  { value: 1900000, label: " 1,900,000 " },
  { value: 2000000, label: " 2,000,000 " },
  { value: 2100000, label: " 2,100,000 " },
  { value: 2200000, label: " 2,200,000 " },
  { value: 2300000, label: " 2,300,000 " },
  { value: 2400000, label: " 2,400,000 " },
  { value: 2500000, label: " 2,500,000 " },
  { value: 2600000, label: " 2,600,000 " },
  { value: 2700000, label: " 2,700,000 " },
  { value: 2800000, label: " 2,800,000 " },
  { value: 2900000, label: " 2,900,000 " },
  { value: 3000000, label: " 3,000,000 " }
];

export const packages = [
  { value: 1, label: "แพ็คเกจ 1" },
  { value: 2, label: "แพ็คเกจ 2" },
  { value: 3, label: "แพ็คเกจ 3" },
  { value: 4, label: "แพ็คเกจ 4" },
  { value: 5, label: "แพ็คเกจ 5" }
];

export const countries = [
  { value: 1, label: "ไทย" },
  { value: 2, label: "สิงค์โปร" },
  { value: 3, label: "จีน" },
  { value: 4, label: "พม่า" },
  { value: 5, label: "ลาว" },
  { value: 6, label: "กัมภูชา" },
  { value: 7, label: "ญี่ปุ่น" },
  { value: 8, label: "เกาหลี" },
  { value: 9, label: "อินโดนีเชีย" }
];

export const mockingOptions = [
  { value: 1, label: "Mocking A" },
  { value: 2, label: "Mocking B" },
  { value: 3, label: "Mocking C" },
  { value: 4, label: "Mocking D" },
  { value: 5, label: "Mocking E" }
];

export const timeOptions = [
  { value: "00:00", label: "00:00 น." },
  { value: "00:30", label: "00:30 น." },
  { value: "01:00", label: "01:00 น." },
  { value: "01:30", label: "01:30 น." },
  { value: "02:00", label: "02:00 น." },
  { value: "02:30", label: "02:30 น." },
  { value: "03:00", label: "03:00 น." },
  { value: "03:30", label: "03:30 น." },
  { value: "04:00", label: "04:00 น." },
  { value: "04:30", label: "04:30 น." },
  { value: "05:00", label: "05:00 น." },
  { value: "05:30", label: "05:30 น." },
  { value: "06:00", label: "06:00 น." },
  { value: "06:30", label: "06:30 น." },
  { value: "07:00", label: "07:00 น." },
  { value: "07:30", label: "07:30 น." },
  { value: "08:00", label: "08:00 น." },
  { value: "08:30", label: "08:30 น." },
  { value: "09:00", label: "09:00 น." },
  { value: "09:30", label: "09:30 น." },
  { value: "10:00", label: "10:00 น." },
  { value: "10:30", label: "10:30 น." },
  { value: "11:00", label: "11:00 น." },
  { value: "11:30", label: "11:30 น." },
  { value: "12:00", label: "12:00 น." },
  { value: "12:30", label: "12:30 น." },
  { value: "13:00", label: "13:00 น." },
  { value: "13:30", label: "13:30 น." },
  { value: "14:00", label: "14:00 น." },
  { value: "14:30", label: "14:30 น." },
  { value: "15:00", label: "15:00 น." },
  { value: "15:30", label: "15:30 น." },
  { value: "16:00", label: "16:00 น." },
  { value: "16:30", label: "16:30 น." },
  { value: "17:00", label: "17:00 น." },
  { value: "17:30", label: "17:30 น." },
  { value: "18:00", label: "18:00 น." },
  { value: "18:30", label: "18:30 น." },
  { value: "19:00", label: "19:00 น." },
  { value: "19:30", label: "19:30 น." },
  { value: "20:00", label: "20:00 น." },
  { value: "20:30", label: "20:30 น." },
  { value: "21:00", label: "21:00 น." },
  { value: "21:30", label: "21:30 น." },
  { value: "22:00", label: "22:00 น." },
  { value: "22:30", label: "22:30 น." },
  { value: "23:00", label: "23:00 น." },
  { value: "23:30", label: "23:30 น." }
];

export const prefix = [
  { value: "นาย", label: "นาย" },
  { value: "นาง", label: "นาง" },
  { value: "นางสาว", label: "นางสาว" }
];

export const cmiInfoGroups = [
  { value: "เลขทะเบียนรถยนต์", label: "เลขทะเบียนรถยนต์" },
  { value: "เลขกรมธรรม์", label: "เลขกรมธรรม์" }
];

export const vmiInfoGroups = [
  { value: "เลขทะเบียนรถยนต์", label: "เลขทะเบียนรถยนต์" },
  { value: "เลขกรมธรรม์", label: "เลขกรมธรรม์" },
  { value: "เลขรับแจ้ง", label: "เลขรับแจ้ง" }
];

export const holderTypes = [
  { value: "individual", label: "บุคคลธรรมดา" },
  { value: "juristic", label: "นิติบุคคล" },
  { value: "taxPerson", label: "บุคคลธรรมดาจดทะเบียนภาษี" },
  { value: "alien", label: "บุคคลต่างด้าว/ต่างชาติ" }
];

export const apiMethod = [
  { value: "GET", label: "GET" },
  { value: "POST", label: "POST" },
  { value: "PUT", label: "PUT" },
  { value: "DELETE", label: "DELETE" },
  { value: "PATCH", label: "PATCH" }
];
